InformationRegisters/НастройкиПоВидуУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПоВидуУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьРасходыПоПокупкеВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыделятьРасходыПриПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОценкиСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьКупленныйКупонПриЧастичномПогашенииОблигации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетаСтоимостиПартий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПартииРЕПООтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОткрыватьКороткиеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОпределенияДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОпределенияДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияНаПартиях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияНаПартияхВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодУчетаПогрешностиОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыУчетаПогрешностиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодикаПерекурсовкиВалютныхАктивовИОбязательств</Name>
					<Comment>#540061</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодикиПерекурсовкиВалютныхАктивовИОбязательств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерекурсовыватьВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексироватьНоминалВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиБумагВЗалоге</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерекурсовыватьВалютныеАктивыВМоментОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПризнанияРасходовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПризнанияРасходовПоСделкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьСтавкуРЕПОнаРыночность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаИндексированногоНоминала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьАктивыПередВыводом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьПроцентныеДоходыПоВыводимымАктивам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияПриПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьАктивыПередПродажей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьПриобретенныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПереоценкиЗадолженностей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПризнанияРасходовПоБиржевымДепозитам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПризнанияРасходовПоСделкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиЦенныхБумаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПериодичностиПерекурсовкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МетодыПризнанияРасходовПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>МетодыПризнанияРасходовПоСделкам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗакрытииРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗависимостиОтПериодичности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриНачислении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗависимостиОтПериодичностиСОтражениемНаСчетеРасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОткрытииРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗакрытии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОткрытии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПоВидуУчета/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ТочностьРасчетаСтоимостиПартий < 2 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Точность расчета стоимости партий не может быть менее двух знаков",,,, Отказ);
			Возврат;
		КонецЕсли;
		
		Если Запись.МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
			И Запись.ВидУчета <> Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НастройкиУчетаКомиссии.ВидЗадолженности КАК ВидЗадолженности,
				|	ВЫБОР
				|		КОГДА НастройкиУчетаКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
				|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссииБрокера)
				|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии)
				|	КОНЕЦ КАК ПравильныйСчет
				|ИЗ
				|	РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
				|			&Период,
				|			ВидУчета = &ВидУчета
				|				И Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))) КАК НастройкиУчетаКомиссии
				|ГДЕ
				|	ВЫБОР
				|			КОГДА НастройкиУчетаКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
				|				ТОГДА НастройкиУчетаКомиссии.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссииБрокера)
				|			ИНАЧЕ НастройкиУчетаКомиссии.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКомиссии)
				|		КОНЕЦ";
			
			Запрос.УстановитьПараметр("ВидУчета", Запись.ВидУчета);
			Запрос.УстановитьПараметр("Период", Запись.Период);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", Запись.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("Организация", Запись.Организация);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ТекстСообщения = СтрШаблон("Счет Д/у: %1, на: %2, по: %3, вид: %4, cчет учета не равен %5",
					Запись.СчетДоверительногоУправления,
					Запись.Период,
					Запись.ВидУчета,
					ВыборкаДетальныеЗаписи.ВидЗадолженности,
					ВыборкаДетальныеЗаписи.ПравильныйСчет.Код);
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Возврат;
			
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры
